Repository: AnmiTaliDev/Iconic
Catalog: po/*.po
Languages: fa, hi, it, tr_tr

source: Iconic
fa: نقشکی
hi: आइकोनिक

source: Add icons on top of folders
fa: افزودن نقشک روی شاخه‌ها

source: Main menu in light mode
fa: فهرست اصلی در حالت روشن
hi: लाइट मोड में मुख्य मेनू
it: Menu principale in modalità luce
tr_tr: Açık tema modunda Ana Menü

source: Accent collored folders supported
fa: شاخه‌های با رنگ لهجه پشتیبانی می‌شوند
tr_tr: Tematik renkli klasörler desteklenir

source: Main menu in dark mode
fa: فهرست اصلی در حالت تیره
hi: डार्क मोड में मुख्य मेनू
it: Menu principale in modalità scura
tr_tr: Karanlık tema modunda Ana Menü

source: Custom colored folder icons supported
fa: شاخه‌های با رنگ سفارشی پشتیبانی می‌شوند
tr_tr: Kişiselleştirilmiş renkli klasör simgeleri desteklenir

source: Here I am, once again. A new update to Iconic is here with the following changes!
fa: باز هم با به‌روز رسانی جدید برای نقشکی یا تغییرات زیر این‌جایم!

source: Improved code
fa: کد بهبود یافته

source: Decrease storage and memory size
fa: کاهش اندازهٔ حافظه و ذخیره‌سازی

source: Improved app closing
fa: بهبود بستن کاره

source: Updated to gnome 48
fa: به‌روز شده به گنوم ۴۸

source: Improved "About Iconic" dialog
fa: گفت‌وگوی «دربارهٔ نقشکی» بهبود یافته

source: Removed donation button from hamburger menu
fa: برداشتن دکمهٔ اعانه از فهرست همبرگری

source: Added keyboard shortcuts
fa: افزودن میان‌برهای صفحه‌کلید

source: Improved accessibility
fa: دسترسی‌پذیری بهبود یافته

source: Increased translatable elements
fa: عنصرهای ترجمه‌پذیر افزایش یافته

source: I am doing a lot of this because I am planning to apply to gnome circle :)
fa: بیش‌تر این کارها را می‌کنم چرا که قصد پیوستن به حلقهٔ گنوم را دارم :)

source: Remember to let me know if you encounter any bugs!
fa: اگر با مشکلی مواجه شدید خبردارم کنید!

source: Have a beautiful day &lt;3
fa: روز خوبی داشته باشید 3>

source: Fixed donation link
fa: پیوند اعانه درست شده

source: As always, if you encounter any bugs. Please let me know on GitHub!
fa: مثل همیشه اگر مشکلی پیدا کردید در گیت‌هاب خبرم کنید!

source: Enjoy the update, and Free Palestine 🇵🇸
fa: از به‌روز رسانی لدّت ببرید؛ و آزاد باد فلسطین 🇵🇸

source: Made the app more responsive
fa: کاره پاسخگوتر شده
tr_tr: Uygulamanın tepki süresi iyileştirildi

source: Removed crashing bug
fa: اشکال فروپاشنده برداشته شده
tr_tr: Çökmeye neden olan hata giderildi

source: Removed small bugs
fa: اشکال‌های کوچک برداشته شده
tr_tr: Küçük hatalar giderildi

source: Added Right-click menu to folder view
fa: فهرست کلیک رایت به نمای شاخه افزوده شده
tr_tr: Klasör görünümüne sağ tıklama menüsü eklendi

source: Custom accent color folders
fa: شاخه‌های با رنگ لهجهٔ سفارشی
tr_tr: Kişiselleştirilmiş vurgu renkli klasörler

source: Accent color detection
fa: تشخیص رنگ لهجه
tr_tr: Tematik rengi algılama

source: Updated settings
fa: تنظیمات به‌روز شده
tr_tr: Güncellenmiş ayarlar

source: Bug fixes!
fa: رفع اشکال‌ها!
tr_tr: Hata düzeltmeleri

source: As always, please let me know if you encounter any bugs!
fa: مثل همیشه اگر به مشکلی برخوردید خبرم کنید!
tr_tr: Her zamanki gibi, herhangi bir hatayla karşılaşırsanız lütfen bana haber verin!

source: Biggest changes
fa: بزرگ‌ترین تغییرات
tr_tr: En büyük değişiklikler

source: Updated to gnome 47
fa: به‌روز شده به گنوم ۴۷
tr_tr: Gnome 47'ye güncellendi

source: Using new loading animation
fa: استفاده کردن از پویانمایی بار کردن جدید
tr_tr: Yeni bir yükleme animasyonu kullanıldı

source: Using new buttons in settings
fa: استفاده کردن از دکمه‌های جدید در تنظیمات
tr_tr: Ayarlarda yeni düğmeler kullanıldı

source: Added donation link
fa: افزودن پیوند اعانه
it: Aggiunto link per donazioni
tr_tr: Bağış linki eklendi

source: Updated Dutch translations
fa: ترجمه‌های هلندی به‌روز شده
it: Traduzione olandese aggiornate
tr_tr: Hollandaca çeviriler güncellendi

source: Please report any bugs you see! Many thanks
fa: لطفاً اشکال‌هایی که می‌بینید را گزارش کنید! سپاس بسیار
it: Segnalateci tutti i bug che vedete! Grazie mille
tr_tr: Lütfen gördüğünüz hataları bildirin! Çok teşekkürler

source: Drag and drop support
fa: پشتیبانی از کشیدن و انداختن
it: Supporto drag and drop
tr_tr: Sürükle ve bırak desteği

source: Copy-paste support
fa: پیشتبانی از رونوشت و جایگذاری
it: Supporto copia-incolla
tr_tr: Kopyala-yapıştır desteği

source: Better file type detection
fa: تشخیص بهتر گونهٔ پرونده
it: Migliore rilevamento del tipo di file
tr_tr: Geliştirilmiş dosya türü tespiti

source: Updated dutch translations
fa: ترجمه‌های هلندی به‌روز شده
it: Traduzione olandese aggiornata
tr_tr: Hollandaca çeviriler güncellendi

source: Added Hindi translations
fa: ترجمه‌های هندی افزوده شده
it: Aggiunte traduzioni in hindi
tr_tr: Hintçe çeviriler eklendi

source: Fixed spelling mistakes
fa: رفع مشکلات نوشتاری
it: Errori di ortografia corretti
tr_tr: Yazım hataları düzeltildi

source: Added italian translation
fa: ترجمه‌های ایتالیایی افزوده شده
hi: इतालवी अनुवाद जोड़ा गया
it: Aggiunta traduzione italiana
tr_tr: İtalyanca çeviriler eklendi

source: Updated Dutch translation
fa: ترجمه‌های هلندی به‌روز شده
hi: डच अनुवाद अद्यतित
it: Aggiornato traduzione olandese
tr_tr: Hollandaca çeviriler güncellendi

source: Initial release
fa: ارائه نخستین
hi: प्रारंभिक रिलीज़
it: Versione iniziale
tr_tr: Başlangıç Sürümü

source: icon
fa: نقشک
hi: आइकन
it: icona
tr_tr: simge

source: create
fa: ایجاد
hi: बनाएं
it: crea
tr_tr: oluştur

source: folder icon
fa: نقشک شاخه
hi: फोल्डर आइकन
it: icona cartella
tr_tr: klasör Simgesi

source: gnome
fa: گنوم
hi: गनोम

source: icon create
fa: ایجاد نقشک
hi: आइकन बनाएं
it: crea icona
tr_tr: simge oluştur

source: icon creator
fa: نقشک‌ساز
hi: आइकन निर्माता
it: creatore di icone
tr_tr: simge oluşturucu

source: folder icon creator
fa: سازندهٔ نقشک شاخه
hi: फोल्डर आइकन निर्माता
it: creatore di icone di cartelle
tr_tr: klasör simgesi oluşturucu

# shortcut window
source: General
fa: عمومی
hi: सामान्य
it: Generale
tr_tr: Genel

# shortcut window
source: Show Shortcuts
fa: نمایش میان‌برها
hi: शॉर्टकट दिखाएं
it: Mostra scorciatoie
tr_tr: Kısayolları Göster

# shortcut window
source: Open Preferences
fa: گشودن ترجیحات

# shortcut window
source: Quit Iconic
fa: خروج از نقشکی

# shortcut window
source: Save Image
fa: ذخیره تصویر

# shortcut window
source: Open top image
fa: گشودن تصویر زیری
hi: शीर्ष छवि खोलें
it: Apri l'immagine in alto
tr_tr: En üstteki görseli aç

# shortcut window
source: Open temporary bottom image
fa: گشودن تصویر زیرین موقّتی
tr_tr: Geçici alttaki resmi aç

# shortcut window
source: Regenerate Images
fa: بازتولید تصویرها
tr_tr: Görüntüleri Yeniden Oluştur

source: General
fa: عمومی
hi: सामान्य
it: Generale
tr_tr: Genel

source: Customise
fa: شخصی‌سازی
hi: अनुकूलित करें
it: Personalizza
tr_tr: Kişiselleştir

source: Use a built-in bottom icon
fa: استفاده از نقشک زیرین توکار
tr_tr: Dahili bir alt simge kullan

source: use the built-in bottom image
fa: استفاده از تصویر زیرین توکار

source: Use system accent color
fa: استفاده از رنگ لهجهٔ سامانه
tr_tr: Sistem tematik rengini kullan

source: Manually select folder color
fa: گزینش دستی رنگ شاخه
tr_tr: Klasör rengini elle seç

source: Blue
fa: آبی
tr_tr: Mavi

source: Teal
fa: سبزآبی
tr_tr: Turkuaz

source: Green
fa: سبز
tr_tr: Yeşil

source: Yellow
fa: زرد
tr_tr: Sarı

source: Orange
fa: نارنجی
tr_tr: Turuncu

source: Red
fa: قرمز
tr_tr: Kırmızı

source: Pink
fa: صورتی
tr_tr: Pembe

source: Purple
fa: بنفش
tr_tr: Mor

source: Slate
fa: سنگی
tr_tr: Arduvaz

source: Custom
fa: سفارشی
tr_tr: Özel

source: Primary Folder Color
fa: رنگ اصلی شاخه
tr_tr: Birincil Klasör Rengi

source: Secondary Folder Color
fa: رنگ دوم شاخه
tr_tr: İkincil Klasör Rengi

source: Use custom bottom icon
fa: استفاده از نقشک زیرین سفارشی
tr_tr: Özel alt simge kullan

source: use a custom bottom image
fa: استفاده از تصویر زیرین سفارشی

source: Currently set bottom icon
fa: نقشک زیرین تنظیم شدهٔ کنونی
tr_tr: Mevcut alt simge

source: Select bottom icon
fa: گزینش نقشک زیرین
tr_tr: Alt simge seç

source: Store top images in cache
fa: ذخیرهٔ تصویرهای رویی در انباره
tr_tr: Üst görüntüleri önbelleğe kaydet

source: Regenerate automatically
fa: بازتولید خودکار
tr_tr: Otomatik olarak yeniden oluştur

source: Current cache used
fa: انبارهٔ استفاده شدهٔ کنونی
tr_tr: Mevcut önbellek kullanımı

source: Remove all cached images
fa: برداشتن همهٔ تصویرهای انبار شده
tr_tr: Önbelleğe alınmış tüm görüntüleri kaldır

source: Default drag-and-drop action
fa: کنش پیش‌گزیده کشیدن و رها کردن
it: Azione predefinita di trascinamento della selezione
tr_tr: Varsayılan sürükle ve bırak eylemi

source: Use a default drag and drop action
fa: استفاده از کنشی پیش‌گزیده برای کشیدن و رها کردن

source: Always select top layer
fa: گزینش همیشگی لایهٔ رویی
it: Seleziona sempre lo strato superiore
tr_tr: Her zaman üst katmanı seç

source: Always select bottom layer
fa: گزینش همیشگی لایهٔ زیرین
it: Seleziona sempre lo strato inferiore
tr_tr: Her zaman alt katmanı seç

source: Advanced
fa: پیشرفته
hi: उन्नत
it: Avanzato
tr_tr: Gelişmiş

source: Select size of SVG images
fa: گزینش اندازهٔ تصویرهای SVG
hi: SVG छवियों का आकार चुनें
it: Seleziona la dimensione delle immagini SVG
tr_tr: SVG görüntülerinin boyutunu belirle

source: Select size of Thumbnail images
fa: گزینش اندازهٔ تصویرهای بندانگشتی
hi: थंबनेल छवियों का आकार चुनें
it: Seleziona la dimensione delle immagini in miniatura
tr_tr: Önizleme boyutu seç

source: Regenerating icons…
fa: بازتولید کردن نقشک‌ها…

source: Menu
fa: فهرست
hi: मेनू
tr_tr: Menü

source: Folder Icon Creator
fa: سازندهٔ نقشک شاخه
hi: फोल्डर आइकन निर्माता
it: Creatore di icone di cartelle
tr_tr: Klasör Simge Oluşturucu

source: Click or Drag to Open Image
fa: زدن یا کشیدن برای گشودن تصویر
it: Fare clic o trascinare per aprire l'immagine
tr_tr: Görüntü Açmak için Tıklayın veya Sürükleyin

source: _Open Image
fa: _گشودن تصویر
hi: छवि खोलें (_O)
it: _Apri immagine
tr_tr: _Görüntü Aç

source: _Show Bottom Layer
fa: _نمایش لایهٔ زیرین
tr_tr: _Alt Katman Göster

source: Save
fa: ذخیره
hi: सहेजें
it: Salva
tr_tr: Kaydet

source: y-position of top image
fa: موقعیت عمودی تصویر رویی

source: New top image is loading
fa: تصویر رویی جدید دارد بار می‌شود

source: x-position of top image
fa: موقعیت افقی تصویر رویی

source: size of top image
fa: اندازهٔ تصویر رویی

source: Toggle Monochrome
fa: تغییر حالت تک‌رنگ
it: Attiva monocromatico
tr_tr: Tek renge geç

source: Turn on monochrome for top image
fa: روشن کردن تک‌رنگ برای تصویر رویی

source: Invert
fa: وارونگی
it: Inverti
tr_tr: Tersine çevir

source: Invert bright and dark in the monochrome image
fa: وارونگی روشن و تیره در تصویر تک‌رنگ

source: Color
fa: رنگ
it: Colore
tr_tr: Renk

source: Choose the color of the monochrome image
fa: گزینش رنگ تصویر تک‌رنگ

source: Reset the color of the monochrome image to default
fa: بازنشانی رنگ تصویر تک‌رنگ به پیش‌گزیده

source: Threshold
fa: آستانه
it: Soglia
tr_tr: Eşik

source: Set the threshold of bright and dark for the monochrome image
fa: تنظیم آستانهٔ روشنی و تیرگی برای تصویر تک‌رنگ

source: Saving…
fa: ذخیره کردن…

source: _Paste Top Icon from Clipboard
fa: _جایگذاری نقشک رویی از تخته‌گیره
it: _Incolla l'icona in alto dagli appunti
tr_tr: _Üst Simgeyi Panodan Yapıştır

source: _Open Top Icon
fa: _گشودن نقشک رویی
hi: शीर्ष आइकन खोलें (_O)
it: _Apri l'icona in alto
tr_tr: _Üst Simgeyi Aç

source: _Open Bottom Icon
fa: _گشودن نقشک زیرین
it: _Apri icona in basso
tr_tr: _Alt Simgeyi Aç

source: _Reset Bottom Icon
fa: _بازنشانی نقشک زیرین
it: _Reimposta icona in basso
tr_tr: _Alt Simge Sıfırla

source: _Regenerate Icons
fa: _بازتولید نقشک‌ها
tr_tr: _Simgeleri Yenile

source: _Preferences
fa: _ترجیحات
hi: प्राथमिकताएं (_P)
it: _Preferenze
tr_tr: _Tercihler

source: _Keyboard Shortcuts
fa: _میان‌برهای صفحه‌کلید
hi: कीबोर्ड शॉर्टकट (_K)
it: _Scorciatoie da tastiera
tr_tr: _Klavye Kısayolları

source: _About Iconic
fa: _دربارهٔ نقشکی
it: Informazioni su Iconic
tr_tr: _Iconic Hakkında

source: Change Top Image
fa: تغییر تصویر رویی
tr_tr: Üstteki Görseli Değiştir

source: Change Bottom Image
fa: تغییر تصویر زیرین
tr_tr: Alttaki Görseli Değiştir

source: Temporarily Change Bottom Image
fa: تغییر موقّتی تصویر زیرین
tr_tr: Geçici Olarak Alttaki Görseli Değiştir

source: Reset Temporary Bottom Image
fa: بازنشانی تصویر زیرین موقّتی
tr_tr: Alttaki Görseli Geçici Olarak Sıfırla

source: Iconic allows you to add images onto a folder.
fa: نقشکی می‌گذارد تصویرها را به شاخه‌ای بیفزایید.

source: translator-credits
fa: دانیال بهزادی <dani.behzi@ubuntu.com>
it: Albano Battistella
tr_tr: e.cokcoskun@yahoo.com

source: Error
fa: خطا
hi: त्रुटि
it: Errore
tr_tr: Hata

source: OK
fa: قبول
hi: ठीक है
tr_tr: TAMAM

source: Open Document
fa: گشودن سند
hi: दस्तावेज खोलें
it: Apri documento
tr_tr: Belgeyi Aç

source: Cancel
fa: لغو
hi: रद्द करें
it: Anulla
tr_tr: İptal

source: Remove
fa: برداشتن
tr_tr: Kaldır

source: Drag and drop
fa: کشیدن و انداختن
tr_tr: Sürükle ve bırak

source: Select layer
fa: گزینش لایه
it: Seleziona livello
tr_tr: Katman seç

source: Top
fa: رو
it: Alto
tr_tr: Üst

source: Bottom
fa: زیر
it: Basso
tr_tr: Alt

source: Save Changes?
fa: ذخیرهٔ تغییرات؟
hi: परिवर्तन सहेजें?
it: Salvare le modifiche?
tr_tr: Değişiklikleri Kaydet?

source: Open image contain unsaved changes. Changes which are not saved will be permanently lost
fa: تصویر باز تغییراتی ذخیره نشده دارد. تغییراتی که ذخیره نشوند برای همیشه از دست خواهند رفت
hi: खुली छवि में सहेजे न गए परिवर्तन हैं। जो परिवर्तन सहेजे नहीं गए वे स्थायी रूप से नष्ट हो जाएंगे
it: L'immagine aperta contiene modifiche non salvate. Le modifiche che non vengono salvate verranno perdute definitivamente
tr_tr: Görüntü kaydedilmemiş değişiklikler içeriyor. Kaydedilmeyen değişiklikler kalıcı olarak kaybolacak

source: Discard
fa: دور ریختن
hi: त्यागें
it: Scarta
tr_tr: Yok say

source: Accent color changed
fa: رنگ لهجه تغییر کرد
tr_tr: Tematik Renk Değiştirildi

source: Regenerating Icons
fa: بازتولید کردن نقشک‌ها
tr_tr: Simgeleri Yeniden Oluşturma

source: Iconic is busy
fa: نقشکی مشغول است

source: Quit anyway
fa: خروج در هر صورت

source: Wait
fa: انتظار

source: No texture found
fa: هیچ بافتی پیدا نشد
it: Nessuna texture trovata
tr_tr: Kaplama bulunamadı

source: Unsupported file type
fa: گونهٔ پروندهٔ پشتیبانی نشده
it: Tipo di file non supportato
tr_tr: Desteklenmeyen dosya türü

source: Nothing to save
fa: چیزی برای ذخیره وجود ندارد

source: Open Folder
fa: گشودن شاخه
hi: फोल्डर खोलें
it: Apri cartella
tr_tr: Klasörü Aç

source: File Saved
fa: پرونده ذخیره شد
hi: फाइल सहेजी गई
it: File salvato
tr_tr: Dosya Kaydedildi

source: File not saved
fa: پرونده ذخیره نشد

source: Icon reset
fa: بازنشانی نقشک
it: Reimpostazione dell'icona
tr_tr: Simge Yenile

source: Nothing selected
fa: چیزی انتخاب نشده
it: Niente di selezionato
tr_tr: Hiçbir şey seçilmedi

source: No file or path found, this is probably not your fault.
fa: پرونده یا مسیری پیدا نشد. احتملاً تقصیر شما نیست.
it: Nessun file o percorso trovato, probabilmente non è colpa tua.
tr_tr: Dosya ya da dizin bulunamadı, bu büyük olasılıkla sizin hatanız değil

source: Regenerating icons
fa: بازتولید کردن نقشک‌ها

source: All files are not compatible for regeneration
fa: همهٔ پرونده‌ها برای بازتولید سازگار نیستند

source: file failed to regenerate view logs for more information
fa: بازتولید پرونده شکست خورد برای اطّلاعات بیش‌تر گزارش را ببینید

source: Regeneration sucessful, restart nautilus
fa: بازتولید موفّق. آغاز دوبارهٔ پرونده‌ها
tr_tr: Yeniden oluşturma başarılı. Nautilus'u yeniden başlatın

source: Easily add icons on top of folders
it: Aggiungi facilmente icone sopra le cartelle
tr_tr: Klasörlerin üzerine kolayca simgeleri ekleyin

source: This program allows an easy and intuitive way to add an icon on top of a folder to help you differentiate it better.
hi: यह प्रोग्राम एक आसान और सहज तरीके से किसी फोल्डर के शीर्ष पर एक आइकन जोड़ने की अनुमति देता है, जिससे आपको इसे बेहतर ढंग से पहचानने में मदद मिलती है।
it: Questo programma consente in modo semplice ed intuitivo di aggiungere un'icona sopra un cartella per aiutarti a differenziarla meglio.
tr_tr: Bu program, klasörleri daha iyi ayırt edebilmenize yardımcı olmak için klasörün üzerine kolay ve sezgisel bir şekilde simge eklemenizi sağlar.

source: This program works best in combination with the app "Icon library" found on flathub and "Adwaita Colors" found on github
tr_tr: Bu program, Flathub'da bulunan "Icon library" ve Github'da bulunan "Adwaita Colors" ile birlikte en iyi şekilde çalışır

source: This program is written in Rust and Libadwaita and is my first attempt at creating an application
hi: यह प्रोग्राम Rust और Libadwaita में लिखा गया है और यह एप्लिकेशन बनाने का मेरा पहला प्रयास है
it: Questo programma è scritto in Rust e Libadwaita ed è il mio primo tentativo di creazione di un'applicazione
tr_tr: Bu program Rust ve Libadwaita ile yazılmıştır ve bir uygulama oluşturmaya yönelik ilk denememdir

source: I was really motivated so I made another update. Now allowing you to set custom collors for the folders. Other features include
tr_tr: Çok motive olduğumdan bir güncelleme daha yaptım. Artık klasörler için özel renkler ayarlamanıza izin veriliyor. Diğer özellikle şunları içerir:

source: A really big update for Iconic! You are now able to regenerate images with the correct accent color after you change it. This makes the app really nice to combine with "Adwaita-Colors"
tr_tr: Iconic için gerçekten büyük bir güncelleme! Artık, vurgu rengini değiştirdikten sonra, görüntüleri doğru vurgu rengiyle yeniden oluşturabilirsiniz. Bu, uygulamayı "Adwaita-Colors" ile birlikte kullanmayı da gerçekten daha güzel hale getiriyor.

source: In Gnome 48, using static images in natilus might change. If that is the case I will retire the app. But for now I will keep working on the app!
tr_tr: Gnome 48'de, Nautilus'ta statik resimlerin kullanımı değişebilir. Eğer durum böyle olursa uygulamayı emekliye ayırabilirim. Şimdilik uygulamayı geliştirmeye devam edeceğim

source: This is a nice big update to Iconic making it way more colorfull and better for gnome 47. Features include
tr_tr: Bu, Iconic için büyük bir güncelleme olup, onu çok daha renkli ve Gnome 47 için daha iyi hale getiriyor. Özellikler şunları içerir:

source: This update to iconic is mostly just a version bump. However I do have some fun features I want to try and implement. If it is possible, idk yet. But I have already started working on it.
tr_tr: Iconic'e yapılan bu güncelleme, çoğunlukla bir sürüm yükseltmesidir. Ancak denemek istediğim bazı özellikler var. Mümkün olup olmadığını henüz bilmiyorum. Ama üzerinde çalışmaya başladım bile

source: A new update to Iconic is here! It does not add many features but features a lot of improvements under the hood, this means the app will now crash way less often without any warning. Some changes include:
it: Un nuovo aggiornamento di Iconic è qui! Non aggiunge molte funzionalità, ma presenta molti miglioramenti sotto il cofano, il che significa che ora l'app si bloccherà molto meno spesso senza alcun preavviso. Alcune modifiche includono:
tr_tr: Iconic'e yeni bir güncelleme geldi! Çok fazla özellik eklemiyor, ancak kaputun altında bir çok iyileştirme içeriyor. Bu da uygulamanın herhangi bir hata vermeden çökmesinin çok azalacağı anlamına geliyor. Bazı değişiklikler şunları içerir:

source: Added ability to drag icon out of iconic directly
it: Aggiunta la possibilità di trascinare l'icona fuori dall'iconic direttamente
tr_tr: Simgeyi doğrudan Iconic'ten dışarı sürükleme özelliği eklendi

source: Added error handling on opening files
it: Aggiunta la gestione degli errori all'apertura dei file
tr_tr: Dosya açma sırasında hata yönetimi eklendi

source: Added error handling on saving files
it: Aggiunta gestione degli errori durante il salvataggio dei file
tr_tr: Dosya kaydetme sırasında hata yönetimi eklendi

source: Added pop-up when dragging in files
it: Aggiunto pop-up durante il trascinamento dei file
tr_tr: Dosyaları sürüklerken açılır pencere eklendi

source: This is a new major release of Iconic. Featuring many bug fixes and added features. Some notable ones are:
it: Questa è una nuova versione importante di Iconic. Con molte correzioni di bug e funzionalità aggiunte. Alcune degne di nota sono:
tr_tr: Bu, Iconic'in yeni bir sürümüdür. Birçok hata düzeltmesi ve ek özellik içerir. Önemli olanlardan bazıları şunlardır:

source: Fixed issues with black pixels not converting to monochrome
it: Risolti i problemi con i pixel neri che non venivano convertiti in monocromatico
tr_tr: Siyah piksellerin tek renge çevrilmesiyle ilgili problemler düzeltildi

source: Another small update with a few additions and changes
hi: कुछ अतिरिक्त और परिवर्तनों के साथ एक और छोटा अपडेट
it: Un altro piccolo aggiornamento con alcune aggiunte e modifiche
tr_tr: Birkaç ekleme ve değişiklik içeren daha küçük bir güncelleme

source: You can now open containing folder after saving image
hi: अब आप छवि सहेजने के बाद संबंधित फोल्डर खोल सकते हैं
it: Ora puoi aprire la cartella contenente l'immagine dopo averla salvata
tr_tr: Artık resmi kaydettikten sonra, bulunduğu klasörü açabilirsiniz

source: This version adds a few small features and fixes some bugs
hi: इस संस्करण में कुछ छोटी खासियतें जोड़ी गई हैं और कुछ बगों को ठीक किया गया है
it: Questa versione aggiunge alcune piccole funzionalità e corregge alcuni bug
tr_tr: Bu sürüm birkaç küçük özellik ekler ve bazı hataları giderir

source: The app now shows some errors as pop-ups
hi: ऐप अब कुछ त्रुटियां पॉप-अप के रूप में दिखाता है
it: L'app ora mostra alcuni errori come popup
tr_tr: Uygulama, artık bazı hataları açılır pencereler olarak gösteriyor

source: You can now temporarily open a new folder image
it: Ora puoi aprire temporaneamente una nuova immagine di cartella
tr_tr: Artık geçici bir süreliğine yeni bir klasör resmi açabilirsiniz

source: It now first shows a pop-up when the folder image is not found
hi: अब जब फोल्डर छवि नहीं मिलती है तो यह सबसे पहले एक पॉप-अप दिखाता है
it: Ora viene prima visualizzato un popup quando l'immagine della cartella non viene trovata
tr_tr: Artık klasör resmi bulunamadığında, ilk olarak bir açılır pencere gösteriliyor.

# shortcut window
source: Quit
hi: बंद करें
it: Esci
tr_tr: Çıkış

# shortcut window
source: Save
hi: सहेजें
it: Salva
tr_tr: Kaydet

source: If you change your system accent color, and want to regenerate the icons, turn this on
tr_tr: Sistem vurgu rengini değiştirdiğinizde simgeleri yeniden oluşturmak için, bu özelliği etkinleştirin

source: If you want to automatically regenerate images after changing accent color, turn this on
tr_tr: Tematik rengi değiştirdikten sonra resimleri otomatik olarak yenilemek isterseniz, bu özelliği etkinleştirin

source: By default, after dragging and dropping a file, you have to select a layer to paste it to. Here you can disable that pop-up
it: Di default, dopo aver trascinato e rilasciato un file, devi selezionare un livello su cui incollarlo. Qui puoi disattivare quel pop-up
tr_tr: Varsayılan olarak, bir dosyayı sürükleyip bıraktıktan sonra, yapıştırmak için bir katman seçmeniz gerekir. Burada bu açılır pencereyi devre dışı bırakabilirsiniz

source: You can see these options because you have enabled the Devel profile
hi: आप ये विकल्प इसलिए देख सकते हैं क्योंकि आपने Devel प्रोफाइल सक्षम कर रखी है
it: Puoi vedere queste opzioni perché hai abilitato il profilo sviluppatore
tr_tr: Bu seçenekleri, Geliştirici profilini etkinleştirdiğiniz için görüyorsunuz

source: SVG images will by default be converted to a 1024x1024 image. You can adjust that here
hi: SVG छवियां तयशुदा रूप से 1024x1024 छवि में परिवर्तित की जाएंगी। आप इसे यहां समायोजित कर सकते हैं
it: Le immagini SVG verranno convertite per impostazione predefinita in un'immagine 1024x1024. È possibile regolarle qui
tr_tr: SVG görselleri, varsayılan olarak 1024x1024 boyutuna dönüştürülür. Bunu bu kısımdan değiştirebilirsiniz
