Repository: AnmiTaliDev/Iconic
Catalog: po/*.po
Languages: fa, hi, it, tr_tr

source: Thumbnail images will by default be converted to a 255x255 image. You can adjust that here
hi: थंबनेल छवियां तयशुदा रूप से 255x255 छवि में परिवर्तित की जाएंगी। आप इसे यहां समायोजित कर सकते हैं
it: Le immagini in miniatura verranno convertite per impostazione predefinita in un'immagine 255x255. Puoi aggiustalo qui
tr_tr: Önizleme görüntüleri, otomatik olarak 255x255 boyutuna dönüştürülür. Bunu bu kısımdan değiştirebilirsiniz.

source: Regenerating
tr_tr: Yeniden Oluşturuluyor

source: Iconic is regenerating the previously generated icons
tr_tr: Iconic, önceden oluşturulmuş simgeleri yeniden oluşturuyor

source: Saving...
tr_tr: Kaydediliyor...

source: _Donate ❤️
it: _Donazione ❤️
tr_tr: _Bağış<3

source: Are you sure you want to clear the cache? Clearing the cache means you probably won't be able to regenerate a lot of images.
tr_tr: Önbelleği temizlemek istediğinizden emin misiniz? Önbelleği temizlemek, büyük olasılıkla birçok görüntüyü yeniden oluşturamayacağınız anlamına gelir.

source: The set folder icon could not be found, press ok to select a new one
hi: निर्धारित फोल्डर आइकन नहीं मिल सका, नया चुनने के लिए 'ठीक है' दबाएं
it: Impossibile trovare l'icona della cartella impostata, premere OK per selezionarne una nuova
tr_tr: Ayarlanan klasör simgesi bulunamadı, yeni bir tane seçmek için Tamam'a basın

source: Did you know that it is possible to drag the folder image straight out of Iconic and drop it into nautilus' property window. No need to save!
tr_tr: Klasör resmini doğrudan Iconic'ten sürükleyip Nautilus'un özellikler penceresine bırakmanın mümkün olduğunu biliyor muydunuz? Kaydetmenize gerek yok!

source: Do you want to load this image to the top or bottom layer?
it: Vuoi caricare questa immagine sul livello superiore o inferiore?
tr_tr: Bu görüntüyü üst katmana mı, yoksa alt katmana mı yüklemek istiyorsunuz?

source: Hint: You can disable this pop-up in the settings
it: Suggerimento: puoi disattivare questo pop-up nelle impostazioni
tr_tr: İpucu: Bu açılır pencereyi ayarlardan devre dışı bırakabilirsiniz

source: The system accent color has been changed, Iconic has automatically changed the color of the folder. If you do not want this, you can turn this off in the settings
tr_tr: Sistemin tematik rengi değişti, Iconic klasör rengini otomatik olarak güncelledi. Eğer bunu istemiyorsanız, ayarlardan bu özelliği kapatabilirsiniz

source: If you drag and drop icons and change your accent color. It is then possible to regenerate the images by pressing "regenerate" in the menu or by pressing ctrl+R
tr_tr: Simgeleri sürükleyip bıraktıktan sonra tema renginizi değiştirirseniz, menüdeki "yenile" seçeneğiyle yada ctrl+R kısayoluyla görselleri tekrar oluşturabilirsiniz

source: All
tr_tr: Hepsi

source: files are not compatible for regeneration
tr_tr: dosyalar yeniden oluşturma için uyumlu değil

source: File
tr_tr: Dosya

# shortcut window
source: Open temporary folder image
hi: अस्थायी फोल्डर छवि खोलें
it: Apri l'immagine della cartella temporanea

source: Currently set bottom icon, click to reset to default
it: Icona in basso attualmente impostata, fare clic per ripristinare l'impostazione predefinita

source: Easilly add icons on top of folders
hi: फोल्डरों के शीर्ष पर आसानी से आइकन जोड़ें

source: Begin screen of application
hi: एप्लिकेशन की आरंभिक स्क्रीन

source: You can now temporarilly open a new folder image
hi: अब आप अस्थायी रूप से एक नई फोल्डर छवि खोल सकते हैं

source: Currently set folder icon, click to reset to default
hi: वर्तमान में निर्धारित फोल्डर आइकन, तयशुदा पर रीसेट करने के लिए क्लिक करें

source: Click to Open Image
hi: छवि खोलने के लिए क्लिक करें

source: _Open Folder Icon
hi: फोल्डर आइकन खोलें (_O)

source: _About folder icon maker
hi: आइकोनिक के बारे में (_A)
